* cabal environment

refs

https://github.com/haskell/cabal/issues/6481

https://hackage.haskell.org/package/build-env

https://blog.ielliott.io/playing-with-ghc-package-databases

#+begin_src sh :results output
cabal exec -- printenv GHC_ENVIRONMENT
#+end_src

#+RESULTS:
: Resolving dependencies...

#+begin_src sh :results output
cabal exec -- bash -c 'cat $(printenv GHC_ENVIRONMENT) | head -n 20'
#+end_src

#+RESULTS:
#+begin_example
-- This is a GHC environment file written by cabal. This means you can
-- run ghc or ghci and get the environment of the project as a whole.
-- But you still need to use cabal repl $target to get the environment
-- of specific components (libs, exes, tests etc) because each one can
-- have its own source dirs, cpp flags etc.
--
clear-package-db
global-package-db
package-db /Users/tonyday567/.cabal/store/ghc-9.6.7/package.db
package-db /Users/tonyday567/haskell/idata/dist-newstyle/packagedb/ghc-9.6.7
package-id idata-0.1.0.0-inplace
package-id base-4.18.3.0
package-id ghc-bignum-1.3
package-id ghc-prim-0.10.0
package-id rts-1.0.2
package-id chrt-svg-0.8.2.1-091fbd55
package-id Clr-0.4.1-965bbd84
package-id dt-dflt-clss-0.2.0.0-18710238
package-id dt-dflt-0.8.0.1-b9be2f67
package-id containers-0.6.7
#+end_example



* llvm

https://minoki.github.io/posts/2025-01-06-ghc-llvm-backend.html

#+begin_src sh :results output
echo $(brew --prefix llvm@15)/bin
#+end_src

#+RESULTS:
: /opt/homebrew/opt/llvm@15/bin


env OPT=$(brew --prefix llvm@15)/bin/opt LLC=$(brew --prefix llvm@15)/bin/llc LLVMAS=$(brew --prefix llvm@15)/bin/clang ghcup install ghc 9.10.3 --force


